TheWiseWolfy/SoundWave-Smart-USB-Headset/PSoC_files/source/usb_comm.c
/*******************************************************************************
* Function Name: usb_comm_register_usb_callbacks
********************************************************************************
* Summary:
*   Registers the USBFS callbacks.
*
*******************************************************************************/
void usb_comm_register_usb_callbacks(void)
{
    Cy_USB_Dev_Audio_RegisterUserCallback(usb_comm_request_received, usb_comm_request_completed, &usb_audioContext);
    Cy_USB_Dev_RegisterClassSetConfigCallback(usb_comm_set_configuration, Cy_USB_Dev_Audio_GetClass(&usb_audioContext));
    Cy_USB_Dev_RegisterClassSetInterfaceCallback(usb_comm_set_interface, Cy_USB_Dev_Audio_GetClass(&usb_audioContext));
}

/*******************************************************************************
* Function Name: usb_comm_get_sample_rate
********************************************************************************
* Summary:
*   Returns the current sample rate.
*
* Return:
*   Current sample rate.
*
*******************************************************************************/
uint32_t usb_comm_get_sample_rate(uint32_t endpoint)
{
    uint32_t newFrequency = (((uint32_t) usb_comm_sample_frequency[endpoint][2] << 16) |
                             ((uint32_t) usb_comm_sample_frequency[endpoint][1] << 8)  |
                             ((uint32_t) usb_comm_sample_frequency[endpoint][0]));

    return newFrequency;
}

/*******************************************************************************
* Function Name: usb_comm_request_received
********************************************************************************
* Summary:
*   Callback implementation for the Audio Request Received.
*
*******************************************************************************/
cy_en_usb_dev_status_t usb_comm_request_received(cy_stc_usb_dev_control_transfer_t *transfer,
                                                 void *classContext,
                                                 cy_stc_usb_dev_context_t *devContext)
{
    (void) classContext; (void) devContext;

    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    if (transfer->setup.bmRequestType.type == CY_USB_DEV_CLASS_TYPE)
    {
        /* Feature Unit */
        if (AUDIO_CONTROL_FEATURE_UNIT == transfer->setup.wIndex)
        {
            /* Control selector */
            switch (CY_HI8(transfer->setup.wValue))
            {
                /* Handle the Audio Mute Control Request */
                case CY_USB_DEV_AUDIO_MUTE_CONTROL:
                {
                    /* Select channel number */
                    switch (CY_LO8(transfer->setup.wValue))
                    {
                        case AUDIO_FEATURE_UNIT_MASTER_CHANNEL:
                        {
                            switch (transfer->setup.bRequest)
                            {
                                case CY_USB_DEV_AUDIO_RQST_GET_CUR:
                                {
                                    /* Get current audio mute control */
                                    transfer->ptr       = &usb_comm_mute;
                                    transfer->remaining = sizeof(usb_comm_mute);

                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;

                                case CY_USB_DEV_AUDIO_RQST_SET_CUR:
                                {
                                    /* Set audio mute control */
                                    transfer->ptr       = transfer->buffer;
                                    transfer->remaining = sizeof(usb_comm_mute);
                                    transfer->notify    = true;

                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;
                            }
                        }
                        break;

                        default:
                            /* Only Master channel is supported */
                        break;
                    }
                }
                break;

                /* Handle the Audio Volume Control Request */
                case CY_USB_DEV_AUDIO_CS_VOLUME_CONTROL:
                {
                    /* Select channel number */
                    switch (CY_LO8(transfer->setup.wValue)) // @suppress("Field cannot be resolved")
                    {
                        case AUDIO_FEATURE_UNIT_MASTER_CHANNEL:
                        {
                            switch (transfer->setup.bRequest)
                            {
                                case CY_USB_DEV_AUDIO_RQST_GET_CUR:
                                {
                                    /* Get current audio volume */
                                    transfer->ptr       = usb_comm_cur_volume; // @suppress("Field cannot be resolved")
                                    transfer->remaining = sizeof(usb_comm_cur_volume);

                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;

                                case CY_USB_DEV_AUDIO_RQST_GET_MIN:
                                {
                                    /* Get current minimum volume */
                                    transfer->ptr       = usb_comm_min_volume;
                                    transfer->remaining = sizeof(usb_comm_min_volume);

                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;

                                case CY_USB_DEV_AUDIO_RQST_GET_MAX:
                                {
                                    /* Get current maximum volume */
                                    transfer->ptr       = usb_comm_max_volume;
                                    transfer->remaining = sizeof(usb_comm_max_volume);

                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;

                                case CY_USB_DEV_AUDIO_RQST_GET_RES:
                                {
                                    /* Get current volume resolution */
                                    transfer->ptr       = usb_comm_res_volume;
                                    transfer->remaining = sizeof(usb_comm_res_volume);

                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;

                                case CY_USB_DEV_AUDIO_RQST_SET_CUR:
                                {
                                    /* Set audio volume  */
                                    transfer->remaining = AUDIO_VOLUME_SIZE;
                                    transfer->notify    = true;

                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;

                                case CY_USB_DEV_AUDIO_RQST_SET_MIN:
                                {
                                    /* Set mininum volume */
                                    transfer->remaining = AUDIO_VOLUME_SIZE;
                                    transfer->notify    = true;

                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;

