TheWiseWolfy/SoundWave-Smart-USB-Headset/PSoC_files/source/usb_comm.c
                                case CY_USB_DEV_AUDIO_RQST_SET_MAX:
                                {
                                    /* Set maximum volume */
                                    transfer->remaining = AUDIO_VOLUME_SIZE;
                                    transfer->notify    = true;

                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;

                                case CY_USB_DEV_AUDIO_RQST_SET_RES:
                                {
                                    /* Set volume resolution */
                                    transfer->remaining = AUDIO_VOLUME_SIZE;
                                    transfer->notify    = true;

                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;

                                default:
                                break;
                            } /* switch (transfer->setup.bRequest) */
                        }
                        break;

                        default:
                        break;
                    } /* switch (CY_LO8(transfer->setup.wValue)) */
                }
                break;

                default:
                break;
            }    /* switch (CY_HI8(transfer->setup.wValue)) */
        }
        /* Endpoint */
        else if ((AUDIO_STREAMING_OUT_ENDPOINT_ADDR == transfer->setup.wIndex) ||
                 (AUDIO_STREAMING_IN_ENDPOINT_ADDR  == transfer->setup.wIndex))
        {
            /* Switch control selector */
            switch (CY_HI8(transfer->setup.wValue))
            {
                /* Handle audio sampling frequency control */
                case CY_USB_DEV_AUDIO_CS_SAMPLING_FREQ_CTRL:
                {
                    switch (transfer->setup.bRequest)
                    {
                        case CY_USB_DEV_AUDIO_RQST_GET_CUR:
                        {
                            /* Get endpoint number */
                            uint32_t endpoint = usb_comm_ep_map[(transfer->setup.wIndex & 0x0FU)];

                            /* Get current sampling frequency */
                            transfer->ptr       = usb_comm_sample_frequency[endpoint];
                            transfer->remaining = AUDIO_SAMPLE_FREQ_SIZE;

                            retStatus = CY_USB_DEV_SUCCESS;
                        }
                        break;

                        case CY_USB_DEV_AUDIO_RQST_SET_CUR:
                        {
                            /* Set sampling frequency */
                            transfer->remaining = AUDIO_SAMPLE_FREQ_SIZE;
                            transfer->notify    = true;

                            retStatus = CY_USB_DEV_SUCCESS;
                        }
                        break;

                        default:
                        break;
                    } /* switch (transfer->setup.bRequest) */
                }
                break;

                default:
                break;
            } /* switch (CY_HI8(transfer->setup.wValue)) */
        }
        else
        {
            /* Unknown */
        }

        BaseType_t xHigherPriorityTaskWoken, xResult;

        /* xHigherPriorityTaskWoken must be initialised to pdFALSE. */
        xHigherPriorityTaskWoken = pdFALSE;

        /* Set USB Event bit in the RTOS Events Group */
        xResult = xEventGroupSetBitsFromISR(
                              rtos_events,
                              RTOS_EVENT_USB,
                              &xHigherPriorityTaskWoken );

        /* Was the message posted successfully? */
        if( xResult != pdFAIL )
        {
            /* If xHigherPriorityTaskWoken is now set to pdTRUE then a context
            switch should be requested.  The macro used is port specific and will
            be either portYIELD_FROM_ISR() or portEND_SWITCHING_ISR() - refer to
            the documentation page for the port being used. */
            portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
        }
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: usb_comm_request_completed
********************************************************************************
* Summary:
*   Callback implementation for the Audio Request Completed.
*
*******************************************************************************/
cy_en_usb_dev_status_t usb_comm_request_completed(cy_stc_usb_dev_control_transfer_t *transfer,
                                                  void *classContext,
                                                  cy_stc_usb_dev_context_t *devContext)
{
    (void) classContext; (void) devContext;

    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    if (transfer->setup.bmRequestType.type == CY_USB_DEV_CLASS_TYPE)
    {
        /* Feature Unit */
        if (AUDIO_CONTROL_FEATURE_UNIT == transfer->setup.wIndex)
        {
            /* Control selector */
            switch (CY_HI8(transfer->setup.wValue))
            {
                case CY_USB_DEV_AUDIO_CS_MUTE_CONTROL:
                {
                    /* Select channel number */
                    switch (CY_LO8(transfer->setup.wValue))
                    {
                        case AUDIO_FEATURE_UNIT_MASTER_CHANNEL:
                        {
                            switch (transfer->setup.bRequest)
                            {
                                case CY_USB_DEV_AUDIO_RQST_SET_CUR:
                                {
                                    /* Update mute control */
                                    memcpy(&usb_comm_mute, transfer->buffer, sizeof(usb_comm_mute));
                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;
                            }
                        }
                        break;

                        default:
                            /* Only Master channel is supported */
                        break;
                    }
                }
                break;

                case CY_USB_DEV_AUDIO_CS_VOLUME_CONTROL:
                {
                    /* Select channel number */
                    switch (CY_LO8(transfer->setup.wValue))
                    {
                        case AUDIO_FEATURE_UNIT_MASTER_CHANNEL:
                        {
                            switch (transfer->setup.bRequest) // @suppress("Field cannot be resolved")
                            {
                                case CY_USB_DEV_AUDIO_RQST_SET_CUR:
                                {
                                    /* Update audio volume */
                                    memcpy(usb_comm_cur_volume, transfer->buffer, sizeof(usb_comm_cur_volume)); // @suppress("Field cannot be resolved")

                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;

                                case CY_USB_DEV_AUDIO_RQST_SET_MIN:
                                {
                                    /* Update minimum volume */
                                    memcpy(usb_comm_min_volume, transfer->buffer, sizeof(usb_comm_min_volume));

                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;

