TheWiseWolfy/SoundWave-Smart-USB-Headset/PSoC_files/source/usb_comm.c
                                case CY_USB_DEV_AUDIO_RQST_SET_MAX:
                                {
                                    /* Update maximum volume */
                                    memcpy(usb_comm_max_volume, transfer->buffer, sizeof(usb_comm_max_volume));

                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;

                                case CY_USB_DEV_AUDIO_RQST_SET_RES:
                                {
                                    /* Update resolution volume */
                                    memcpy(usb_comm_res_volume, transfer->buffer, sizeof(usb_comm_res_volume));

                                    retStatus = CY_USB_DEV_SUCCESS;
                                }
                                break;

                                default:
                                break;
                            } /* switch (transfer->setup.bRequest) */
                        }
                        break;

                        default:
                        break;
                    } /* switch (CY_LO8(transfer->setup.wValue)) */
                }
                break;

                default:
                break;
            } /* switch (CY_HI8(transfer->setup.wValue)) */
        }
        else if ((AUDIO_STREAMING_OUT_ENDPOINT_ADDR == transfer->setup.wIndex) ||
                 (AUDIO_STREAMING_IN_ENDPOINT_ADDR  == transfer->setup.wIndex))
        {
            /* Switch control selector */
            switch (CY_HI8(transfer->setup.wValue))
            {
                case CY_USB_DEV_AUDIO_CS_SAMPLING_FREQ_CTRL:
                {
                    /* Get endpoint number */
                    uint32_t endpoint = usb_comm_ep_map[(transfer->setup.wIndex & 0x0FU)];

                    switch (transfer->setup.bRequest)
                    {
                        case CY_USB_DEV_AUDIO_RQST_SET_CUR:
                        {
                            memcpy(usb_comm_sample_frequency[endpoint], transfer->ptr, AUDIO_SAMPLE_FREQ_SIZE);

                            /* Configure feedback endpoint data */
                            usb_comm_new_sample_rate = usb_comm_get_sample_rate(endpoint);

                            /* Clear Sync bit */
                            xEventGroupClearBitsFromISR(rtos_events,
                                                        RTOS_EVENT_SYNC);

                            retStatus = CY_USB_DEV_SUCCESS;
                        }
                        break;

                        default:
                        break;
                    }
                }
                break;

                default:
                break;
            } /* switch (CY_HI8(transfer->setup.wValue)) */
        }
        else
        {
            /* Unknown */
        }

        BaseType_t xHigherPriorityTaskWoken, xResult;

        /* xHigherPriorityTaskWoken must be initialised to pdFALSE. */
        xHigherPriorityTaskWoken = pdFALSE;

        /* Set USB Event bit in the RTOS Events Group */
        xResult = xEventGroupSetBitsFromISR(
                              rtos_events,
                              RTOS_EVENT_USB,
                              &xHigherPriorityTaskWoken );

        /* Was the message posted successfully? */
        if( xResult != pdFAIL )
        {
            /* If xHigherPriorityTaskWoken is now set to pdTRUE then a context
            switch should be requested.  The macro used is port specific and will
            be either portYIELD_FROM_ISR() or portEND_SWITCHING_ISR() - refer to
            the documentation page for the port being used. */
            portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
        }
    }

    return retStatus;
}

/*******************************************************************************
* Function Name: usb_comm_set_configuration
********************************************************************************
* Summary:
*   Callback implementation for the Audio Set Configuration.
*
*******************************************************************************/
cy_en_usb_dev_status_t usb_comm_set_configuration(uint32_t config,
                                                  void *classContext,
                                                  cy_stc_usb_dev_context_t *devContext)
{
    (void) classContext;
    (void) devContext;
    (void) config;

    return CY_USB_DEV_SUCCESS;
}

/*******************************************************************************
* Function Name: usb_comm_set_interface
********************************************************************************
* Summary:
*   Callback implementation for the Audio Set Interface.
*
*******************************************************************************/
cy_en_usb_dev_status_t usb_comm_set_interface(uint32_t interface,
                                              uint32_t alternate,
                                              void *classContext,
                                              cy_stc_usb_dev_context_t *devContext)
{
    (void) classContext;
    (void) devContext;

    if (AUDIO_STREAMING_OUT_INTERFACE == interface)
    {
        /* Check interface OUT Streaming alternate */
        usb_comm_enable_out_streaming = (AUDIO_STREAMING_OUT_ALTERNATE == alternate);

        if (usb_comm_enable_out_streaming)
        {
            if (NULL != usb_comm_interface.enable_out)
            {
                usb_comm_interface.enable_out();
            }
        }
        else
        {
            if (NULL != usb_comm_interface.disable_out)
            {
                usb_comm_interface.disable_out();
            }
        }
    }

    if (AUDIO_STREAMING_IN_INTERFACE == interface)
    {
        /* Check interface IN Streaming alternate */
        usb_comm_enable_in_streaming = (AUDIO_STREAMING_IN_ALTERNATE == alternate);

        if (usb_comm_enable_in_streaming)
        {
            if (NULL != usb_comm_interface.enable_in)
            {
                usb_comm_interface.enable_in();
            }
        }
        else
        {
            if (NULL != usb_comm_interface.disable_in)
            {
                usb_comm_interface.disable_in();
            }
        }
    }

    return CY_USB_DEV_SUCCESS;
}

/***************************************************************************
* Function Name: usb_high_isr
********************************************************************************
* Summary:
*  This function processes the high priority USB interrupts.
*
***************************************************************************/
static void usb_high_isr(void)
{
    /* Call interrupt processing */
    Cy_USBFS_Dev_Drv_Interrupt(CYBSP_USBDEV_HW, 
                               Cy_USBFS_Dev_Drv_GetInterruptCauseHi(CYBSP_USBDEV_HW), 
                               &usb_drvContext);
}


/***************************************************************************
* Function Name: usb_medium_isr
********************************************************************************
* Summary:
*  This function processes the medium priority USB interrupts.
*
***************************************************************************/
static void usb_medium_isr(void)
{
    /* Call interrupt processing */
    Cy_USBFS_Dev_Drv_Interrupt(CYBSP_USBDEV_HW, 
                               Cy_USBFS_Dev_Drv_GetInterruptCauseMed(CYBSP_USBDEV_HW), 
                               &usb_drvContext);
}


/***************************************************************************
* Function Name: usb_low_isr
********************************************************************************
* Summary:
*  This function processes the low priority USB interrupts.
*
**************************************************************************/
static void usb_low_isr(void)
{
    /* Call interrupt processing */
    Cy_USBFS_Dev_Drv_Interrupt(CYBSP_USBDEV_HW, 
                               Cy_USBFS_Dev_Drv_GetInterruptCauseLo(CYBSP_USBDEV_HW), 
                               &usb_drvContext);
}

/* [] END OF FILE */
